Revit 2024 API
XYZ.Negate Method
Negates this vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ Negate()
Visual Basic
Public Function Negate As XYZ
Visual C++
public:
XYZ^ Negate()
Return Value
The vector opposite to this vector.
Remarks
 The negated vector is obtained by changing the sign of each coordinate of this vector.
See Also
XYZ Class
Autodesk.Revit.DB Namespace